src/bsl/Documents/гкс_РеестрНакладныхЗПП3.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>гкс_РеестрНакладныхЗПП3</Name>
			<Comment>ERP-1526</Comment>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.гкс_ОформленныеПартии</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Спецификация</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_СпецификацияКДоговоруКонтрагента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Грузоотправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦенаВключаетНДС</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтавкаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаСНДС</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФизическийВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗачетныйВес</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_АлгоритмыРасчетаПоказателейКачестваНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Анализ</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_ЛабораторныйАнализ</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВеса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_ВидВесаНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Собственник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Накладные</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ДокументРегистрации</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Брутто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Нетто</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Тара</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>КачественныеПоказатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Натуральная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Денежная</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Показатель</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Базис</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>14</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаНадбавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкидкаНадбавка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>7</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаСНДС</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДобавлятьВСтоимость</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипВеса</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УпаковкиЕдиницыИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоУслуги</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bsl/InformationRegisters/гкс_СопоставлениеПоказателейАнализовНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>гкс_СопоставлениеПоказателейАнализовНоменклатуры</Name>
			<Comment>GKSTCPLK-1866</Comment>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>КоммерческийПоказатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Показатель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ПоказателиАнализовНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/bsl/Documents/гкс_НаправлениеНаРазгрузку.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>гкс_НаправлениеНаРазгрузку</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТочкаМаршрута</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументРегистрации</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.гкс_РегистрацияНаПЛК</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПервичныйСтатус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.гкс_СостоянияРегистрации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПринятьКачество</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МестнаяДата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЯмаРазгрузки</Name>
					<Comment>ERP-1094</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СлужебнаяНоменклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеМестаРазгрузки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Силос</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СлужебнаяНоменклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФактическаяРазгрузка</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЯмаРазгрузки</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.гкс_ТочкиМаршрута</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/bsl/Documents/гкс_РеестрНакладныхЗПП3/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область Проведение

// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт

	МеханизмыДокумента.Добавить("ДокументальноеОформление");

КонецПроцедуры

// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - коллекция элементов:
//     * Таблица<ИмяРегистра> - ТаблицаЗначений - таблица данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт

	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = гкс_ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;

	Запрос = Новый Запрос;
	ТекстыЗапроса = Новый СписокЗначений;

	Если НЕ ДопПараметры.ПолучитьТекстыЗапроса Тогда
		// Создадим запрос инициализации движений
		ЗаполнитьПараметрыИнициализации(Запрос, Документ, ДопПараметры);
		// Сформируем текст запроса
		ТекстЗапросаТаблицаОформленныеПартии(ТекстыЗапроса, Регистры);
	КонецЕсли;

	// Получим таблицы для движений
	Возврат гкс_ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);

КонецФункции

#КонецОбласти

// Возвращает массив документов "Основание для движения запасов" для документов регистрации табличной части
//
// Параметры:
//  РеестрНакладных - ДокументСсылка.гкс_РеестрНакладныхЗПП3 - ссылка на документ, по которому необходимо
//  														   получить данные
//
// Возвращаемое значение:
//  Массив - массив документов "Основание для движения запасов"
//
Функция ОснованияДвиженияЗапасовРеестра(РеестрНакладных) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	ОснованиеДляДвиженияЗапасов.Ссылка КАК ОснованиеДвиженияЗапасов
	|ИЗ
	|	Документ.гкс_РеестрНакладныхЗПП3.Накладные КАК РеестрНакладныхЗПП3Накладные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ОснованиеДляДвиженияЗапасов КАК ОснованиеДляДвиженияЗапасов
	|		ПО РеестрНакладныхЗПП3Накладные.ДокументРегистрации = ОснованиеДляДвиженияЗапасов.Регистрация
	|ГДЕ
	|	РеестрНакладныхЗПП3Накладные.Ссылка = &Ссылка";

	Запрос.УстановитьПараметр("Ссылка", РеестрНакладных);
	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда
		ДанныеЗапроса = РезультатЗапроса.Выгрузить();
		Результат = ДанныеЗапроса.ВыгрузитьКолонку("ОснованиеДвиженияЗапасов");
	Иначе
		Результат = Неопределено;
	КонецЕсли;

	Возврат Результат;

КонецФункции

// Определяет указанный склад разгрузки для регистрации на ПЛК.
//
// Параметры:
//  Регистрация - ДокументСсылка.гкс_РегистрацияНаПЛК -
//
// Возвращаемое значение:
//  СправочникСсылка.Склады
//
Функция СкладРазгрузкиРегистрации(Регистрация) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТочкиМаршрута.Склад КАК Склад
	|ИЗ
	|	Документ.гкс_НаправлениеНаРазгрузку КАК НаправлениеНаРазгрузку
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.гкс_ТочкиМаршрута КАК ТочкиМаршрута
	|		ПО НаправлениеНаРазгрузку.Склад = ТочкиМаршрута.Ссылка
	|ГДЕ
	|	НаправлениеНаРазгрузку.ДокументРегистрации = &Регистрация";

	Запрос.УстановитьПараметр("Регистрация", Регистрация);

	РезультатЗапроса = Запрос.Выполнить();

	Если НЕ РезультатЗапроса.Пустой() Тогда

		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		Результат = Выборка.Склад;
	Иначе
		Результат = Справочники.Склады.ПустаяСсылка();
	КонецЕсли;

	Возврат Результат;

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(ТочкаМаршрута)
	|	И ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// СтандартныеПодсистемы.ВариантыОтчетов

// Определяет список команд отчетов.
//
// Параметры:
//  КомандыОтчетов - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.КомандыОтчетов
//  Параметры - см. ВариантыОтчетовПереопределяемый.ПередДобавлениемКомандОтчетов.Параметры
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры) Экспорт

	ВариантыОтчетовПереопределяемый.ДобавитьКомандуСтруктураПодчиненности(КомандыОтчетов);

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВариантыОтчетов

// СтандартныеПодсистемы.Печать

 // Переопределяет настройки печати для объекта.
//
// Параметры:
//  Настройки - см. УправлениеПечатью.НастройкиПечатиОбъекта.
//
Процедура ПриОпределенииНастроекПечати(Настройки) Экспорт

	Настройки.ПриДобавленииКомандПечати = Истина;

КонецПроцедуры

// Заполняет список команд печати.
// Параметры:
//   КомандыПечати - см. УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт

	МодульЛокализации = гкс_ЛокализацияСервер.МодульЛокализации("гкс_РеестрНакладныхЗПП3");

	Если ТипЗнч(МодульЛокализации) = Тип("ОбщийМодуль") Тогда
		МодульЛокализации.ДобавитьКомандыПечати(КомандыПечати);
	Иначе
		// форма ЗПП-3
		КомандаПечати = КомандыПечати.Добавить();
		КомандаПечати.Обработчик = "гкс_УправлениеПечатьюКлиент.ВыполнитьКомандуПечати_ПФЗПП3";
		КомандаПечати.Идентификатор = "ПФ_MXL_ЗПП3";
		КомандаПечати.Представление = НСтр("ru = 'Реестр (форма ЗПП-3)'");
		КомандаПечати.ПроверкаПроведенияПередПечатью = Ложь;
		КомандаПечати.Порядок = 1;
	КонецЕсли;

КонецПроцедуры

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов - см. УправлениеПечатьюПереопределяемый.ПриПечати.МассивОбъектов
//  ПараметрыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыПечати
//  КоллекцияПечатныхФорм - см. УправлениеПечатьюПереопределяемый.ПриПечати.КоллекцияПечатныхФорм
//  ОбъектыПечати - см. УправлениеПечатьюПереопределяемый.ПриПечати.ОбъектыПечати
//  ПараметрыВывода - см. УправлениеПечатьюПереопределяемый.ПриПечати.ПараметрыВывода
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт

	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_ЗПП3") Тогда

		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_ЗПП3",
			НСтр("ru = 'Реестр (форма ЗПП-3)'"),
			СформироватьПечатнуюФормуЗПП3(МассивОбъектов, ОбъектыПечати, ПараметрыПечати), ,
			"Документ.гкс_РеестрНакладныхЗПП3.ПФ_MXL_ЗПП3");

	КонецЕсли;

КонецПроцедуры

// Конец СтандартныеПодсистемы.Печать

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область Проведение

Процедура ЗаполнитьПараметрыИнициализации(Запрос, ДокументСсылка, ДопПараметры)

	МенеджерВременныхТаблиц = Неопределено;

	Если ДопПараметры <> Неопределено
		И ДопПараметры.Свойство("МенеджерВременныхТаблиц", МенеджерВременныхТаблиц) Тогда

		МенеджерВременныхТаблиц = ?(МенеджерВременныхТаблиц = Неопределено,
									Новый МенеджерВременныхТаблиц, МенеджерВременныхТаблиц);
	Иначе
		МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	КонецЕсли;

	Запрос.МенеджерВременныхТаблиц = МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
	Запрос.УстановитьПараметр("Пользователь", Пользователи.ТекущийПользователь());

КонецПроцедуры

Процедура ТекстЗапросаТаблицаОформленныеПартии(ТекстыЗапроса, Регистры)

	ИмяРегистра = "гкс_ОформленныеПартии";

	Если НЕ гкс_ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат;
	КонецЕсли;

	ТекстЗапроса =
	"ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	РеестрНакладныхЗПП3Накладные.ДокументРегистрации КАК ДокументРегистрации,
	|	РеестрНакладныхЗПП3Накладные.Ссылка КАК РеестрНакладных,
	|	РеестрНакладныхЗПП3.Дата КАК ДатаРеестра,
	|	ЕСТЬNULL(ОснованиеДляДвиженияЗапасов.Ссылка, ЗНАЧЕНИЕ(Документ.гкс_ОснованиеДляДвиженияЗапасов.ПустаяСсылка)) КАК ОснованиеДвиженияЗапасов
	|ИЗ
	|	Документ.гкс_РеестрНакладныхЗПП3.Накладные КАК РеестрНакладныхЗПП3Накладные
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РеестрНакладныхЗПП3 КАК РеестрНакладныхЗПП3
	|		ПО РеестрНакладныхЗПП3Накладные.Ссылка = РеестрНакладныхЗПП3.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ОснованиеДляДвиженияЗапасов КАК ОснованиеДляДвиженияЗапасов
	|		ПО РеестрНакладныхЗПП3Накладные.ДокументРегистрации = ОснованиеДляДвиженияЗапасов.Регистрация
	|ГДЕ
	|	РеестрНакладныхЗПП3Накладные.Ссылка = &Ссылка";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);

КонецПроцедуры

#КонецОбласти

#Область Печать

Функция КлючОбъектаПользовательскихНастроек() Экспорт

	Возврат "Документ.гкс_РеестрНакладныхЗПП3";

КонецФункции

// Настройки печати по умолчанию.
//
// Возвращаемое значение:
//  Структура - Настройки печати по умолчанию:
// * РуководительЛаборатории - Строка -
// * РеестрСоставил - СправочникСсылка.гкс_ОтветственныеЛица -
// * МОЛ - СправочникСсылка.гкс_ОтветственныеЛица -
// * Проверил - СправочникСсылка.гкс_ОтветственныеЛица -
// * РезультатПроверки - Строка -
Функция НастройкиПечатиПоУмолчанию() Экспорт

	Результат = Новый Структура;
	Результат.Вставить("РуководительЛаборатории", "");
	Результат.Вставить("РеестрСоставил", Справочники.гкс_ОтветственныеЛица.ПустаяСсылка());
	Результат.Вставить("МОЛ", Справочники.гкс_ОтветственныеЛица.ПустаяСсылка());
	Результат.Вставить("Проверил", Справочники.гкс_ОтветственныеЛица.ПустаяСсылка());
	Результат.Вставить("РезультатПроверки", "");

	Возврат Результат;

КонецФункции

#Область ПечатьЗПП3

Функция СформироватьПечатнуюФормуЗПП3(МассивОбъектов, ОбъектыПечати, ПараметрыПечати)

	Макет =	ПолучитьМакет("ПФ_MXL_ЗПП3");
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати 	= "ПАРАМЕТРЫ_ПЕЧАТИ_ЗПП3";
	ТабличныйДокумент.ДвусторонняяПечать 	= ТипДвустороннейПечати.ПереворотВлево;
	ТабличныйДокумент.АвтоМасштаб 			= Истина;

	РезультатыЗапросов 	= ИнициализироватьДанныеПечатиЗПП3(МассивОбъектов);
	Шапка 		= 11;
	Накладные	= 12;
	Услуги		= 13;
	УслугиИтоги	= 14;
	Показатели	= 15;

	ВыборкаШапка 		= РезультатыЗапросов[Шапка]			.Выбрать();
	ВыборкаНакладные	= РезультатыЗапросов[Накладные]		.Выбрать();
	ВыборкаУслуги       = РезультатыЗапросов[Услуги]		.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	ВыборкаУслугиИтоги 	= РезультатыЗапросов[УслугиИтоги]	.Выбрать();
	ВыборкаПоказатели 	= РезультатыЗапросов[Показатели]	.Выбрать();

	Пока ВыборкаШапка.Следующий() Цикл

		ОбластьЛицеваяСторонаШапка 					= Макет.ПолучитьОбласть("ЛицеваяСторонаШапка");
		ОбластьЛицеваяСторонаПодвал 				= Макет.ПолучитьОбласть("ЛицеваяСторонаПодвал");
		ОбластьЛицеваяСторонаСтрока					= Макет.ПолучитьОбласть("ЛицеваяСторонаСтрока");
		ОбластьОборотнаяСторонаАнализы 				= Макет.ПолучитьОбласть("ОборотнаяСторонаАнализы");
		ОбластьОборотнаяСторонаДенежныйРасчетШапка 	= Макет.ПолучитьОбласть("ОборотнаяСторонаДенежныйРасчетШапка");
		ОбластьОборотнаяСторонаДенежныйРасчетСтрока = Макет.ПолучитьОбласть("ОборотнаяСторонаДенежныйРасчетСтрока");
		ОбластьОборотнаяСторонаДенежныйРасчетИтог 	= Макет.ПолучитьОбласть("ОборотнаяСторонаДенежныйРасчетИтог");
		ОбластьОборотнаяСторонаПодвал 				= Макет.ПолучитьОбласть("ОборотнаяСторонаПодвал");

		НомерСтрокиНачало 	= ТабличныйДокумент.ВысотаТаблицы + 1;
		Отбор 				= Новый Структура("Ссылка", ВыборкаШапка.Ссылка);
		ВыборкаНакладные	.Сбросить();
		ВыборкаПоказатели	.Сбросить();
		ВыборкаУслуги		.Сбросить();
		ВыборкаУслугиИтоги	.Сбросить();

		////////////////////////////////////////////////////////////////////////////////
		// Шапка
		ВывестиОбластьЛицеваяСторонаШапка(ВыборкаШапка, ОбластьЛицеваяСторонаШапка, ТабличныйДокумент);

		////////////////////////////////////////////////////////////////////////////////
		// РАЗДЕЛ I. Накладные
		ВывестиОбластьЛицеваяСторонаСтрока_Подвал(
			ВыборкаНакладные, ВыборкаШапка, ОбластьЛицеваяСторонаПодвал, ОбластьЛицеваяСторонаСтрока,
			Отбор, ПараметрыПечати, ТабличныйДокумент);

		////////////////////////////////////////////////////////////////////////////////
		// РАЗДЕЛ II. Лабораторный анализ среднесуточной пробы
		ВывестиОбластьОборотнаяСторонаАнализы(
			ВыборкаПоказатели, ВыборкаШапка, ОбластьОборотнаяСторонаАнализы,
			Отбор, ПараметрыПечати, ТабличныйДокумент);

		////////////////////////////////////////////////////////////////////////////////
		// РАЗДЕЛ III. Денежный расчет
		ВывестиОбластьОборотнаяСторонаДенежныйРасчетШапка(
			ВыборкаУслугиИтоги, ВыборкаШапка, ОбластьОборотнаяСторонаДенежныйРасчетШапка,
			Отбор, ТабличныйДокумент);

		ВывестиОбластьОборотнаяСторонаДенежныйРасчетСтрокаИтог(
			ВыборкаУслуги, ОбластьОборотнаяСторонаДенежныйРасчетИтог,
			ОбластьОборотнаяСторонаДенежныйРасчетСтрока, Отбор, ТабличныйДокумент);

		////////////////////////////////////////////////////////////////////////////////
		// Подвал
		ВывестиОбластьОборотнаяСторонаПодвал(ОбластьОборотнаяСторонаПодвал, ПараметрыПечати, ТабличныйДокумент);

		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(
			ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ВыборкаШапка.Ссылка);

	КонецЦикла;

	Возврат ТабличныйДокумент;

КонецФункции

Процедура ВывестиОбластьЛицеваяСторонаШапка(ВыборкаШапка, ОбластьЛицеваяСторонаШапка, ТабличныйДокумент)

	ОбластьЛицеваяСторонаШапка.Параметры.Заполнить(ВыборкаШапка);
	ОбластьЛицеваяСторонаШапка.Параметры["Дата"] =
		Формат(ВыборкаШапка.Дата, "ДЛФ=DD");
	ОбластьЛицеваяСторонаШапка.Параметры["Происхождение"] =
		ОбластьВАдресеКонтрагента(ВыборкаШапка.ГрузоотправительАдрес);
	ТабличныйДокумент.Вывести(ОбластьЛицеваяСторонаШапка);

КонецПроцедуры

Процедура ВывестиОбластьЛицеваяСторонаСтрока_Подвал(
		ВыборкаНакладные,
		ВыборкаШапка,
		ОбластьЛицеваяСторонаПодвал,
		ОбластьЛицеваяСторонаСтрока,
		Отбор,
		ПараметрыПечати,
		ТабличныйДокумент)

	КоличествоДополнительныхСтрок = КоличествоДополнительныхСтрокДляВыводаНакладных(ВыборкаШапка);
	ПараметрСлева				= Истина;
	ИндексСтроки				= 1;
	КлючиПараметровОбласти		= СтрРазделить(
		"ДатаНакладной,НомерНакладной,Масса,НомерТранспорта", ",", Ложь);
	ПунктРазгрузкиСклад 		= "";
	Пока ВыборкаНакладные.НайтиСледующий(Отбор) Цикл

		ПунктРазгрузкиСклад = ВыборкаНакладные.ПунктРазгрузкиСклад;
		Если КоличествоДополнительныхСтрок > 0 Тогда

			// Заполняем параметры
			Для Каждого КлючЗначение Из КлючиПараметровОбласти Цикл
				ИмяПараметра = СтрШаблон("%1%2", КлючЗначение, ?(ПараметрСлева, "Лево", "Право"));
				ОбластьЛицеваяСторонаСтрока.Параметры[ИмяПараметра] = ВыборкаНакладные[КлючЗначение];
			КонецЦикла;

			ПараметрСлева =	Не ПараметрСлева; // Следующий заполняется параметр Справа
			Если ПараметрСлева Тогда
				КоличествоДополнительныхСтрок	= КоличествоДополнительныхСтрок - 1;	// Уменьшаем кол-во доп. строк
				ТабличныйДокумент.Вывести(ОбластьЛицеваяСторонаСтрока);
			КонецЕсли;

		Иначе

			Для Каждого КлючЗначение Из КлючиПараметровОбласти Цикл
				ОбластьЛицеваяСторонаПодвал.Параметры[СтрШаблон("%1Лево%2", КлючЗначение, ИндексСтроки)]
					= ВыборкаНакладные[КлючЗначение];
			КонецЦикла;

			ИндексСтроки = ИндексСтроки + 1;

		КонецЕсли;

	КонецЦикла;

	Если Не ПараметрСлева Тогда
		ТабличныйДокумент.Вывести(ОбластьЛицеваяСторонаСтрока);
	КонецЕсли;

	ОбластьЛицеваяСторонаПодвал.Параметры.Заполнить(ВыборкаШапка);

	ЗаполнитьМассуНакладныхВПодвале(ВыборкаШапка, ОбластьЛицеваяСторонаПодвал);
    ОбластьЛицеваяСторонаПодвал.Параметры["Склад"] 						= ПунктРазгрузкиСклад;
	ОбластьЛицеваяСторонаПодвал.Параметры["ДолжностьМОЛ"] 				= ПараметрыПечати.МОЛ;

	ТабличныйДокумент.Вывести(ОбластьЛицеваяСторонаПодвал);
	ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();

КонецПроцедуры

Процедура ЗаполнитьМассуНакладныхВПодвале(ВыборкаШапка, ОбластьЛицеваяСторонаПодвал)

	КгВТонне 		= 1000;
	ЦелаяЧасть 		= Цел(ВыборкаШапка.ФизическийВес);
	ДробнаяЧасть 	= (ВыборкаШапка.ФизическийВес - Цел(ВыборкаШапка.ФизическийВес)) * КгВТонне;

	ОбластьЛицеваяСторонаПодвал.Параметры["МассаНакладныхПрописью"]
		= ЧислоПрописью(ЦелаяЧасть,"Л = ru_RU; НД=Ложь; ДП = Ложь", "т, т, т, ж, т, т, т, ж, 0");
	ОбластьЛицеваяСторонаПодвал.Параметры["МассаНакладныхДробнаяЧасть"]
		= ДробнаяЧасть;

КонецПроцедуры

Функция КоличествоДополнительныхСтрокДляВыводаНакладных(ВыборкаШапка)

	МаксКолНакладныхВМакете			= 11;
	КоличествоСторон				= 2;
	КоличествоДополнительныхСтрок	= ?(ВыборкаШапка.КоличествоНакладных > МаксКолНакладныхВМакете,
		Окр((ВыборкаШапка.КоличествоНакладных - МаксКолНакладныхВМакете) / КоличествоСторон), 1);
	Возврат КоличествоДополнительныхСтрок;

КонецФункции

Процедура ВывестиОбластьОборотнаяСторонаАнализы(
	ВыборкаПоказатели,
	ВыборкаШапка,
	ОбластьОборотнаяСторонаАнализы,
	Отбор,
	ПараметрыПечати,
	ТабличныйДокумент)

	МенеджерПоказатели = Справочники.гкс_ПоказателиАнализовНоменклатуры;

	ОбластьОборотнаяСторонаАнализы.Параметры.Заполнить(ВыборкаШапка);
	ОбластьОборотнаяСторонаАнализы.Параметры["ДатаОбразца"]
		= Формат(ВыборкаШапка.ДатаОбразца, "ДЛФ=DD");
	ОбластьОборотнаяСторонаАнализы.Параметры["РуководительЛаборатории"]
		= ПараметрыПечати.РуководительЛаборатории;

	РезультатыАнализов	= Новый Структура;
	РезультатыАнализов.Вставить("НатуральнаяСкидка"	, ВыборкаШапка.НатуральнаяСкидкаНадбавка);
	РезультатыАнализов.Вставить("ДенежнаяСкидка"	, ВыборкаШапка.ДенежнаяСкидкаНадбавка);
	ПрефиксСкидкиНадбавки = "_Процент";
	Пока ВыборкаПоказатели.НайтиСледующий(Отбор) Цикл

		ДобавитьПоказательВРезультатыАнализов(
			ВыборкаПоказатели, МенеджерПоказатели, РезультатыАнализов);
        ДобавитьДенежнуюСкидкуНадбавкуВРезультатыАнализов(
			ВыборкаПоказатели, МенеджерПоказатели, ПрефиксСкидкиНадбавки, РезультатыАнализов);
        ДобавитьНатуральнуюСкидкуНадбавкуВРезультатыАнализов(
			ВыборкаПоказатели, МенеджерПоказатели, ПрефиксСкидкиНадбавки, РезультатыАнализов);

	КонецЦикла;

	ОбластьОборотнаяСторонаАнализы.Параметры.Заполнить(РезультатыАнализов);
	ТабличныйДокумент.Вывести(ОбластьОборотнаяСторонаАнализы);

КонецПроцедуры

Процедура ДобавитьНатуральнуюСкидкуНадбавкуВРезультатыАнализов(
		ВыборкаПоказатели,
		МенеджерПоказатели,
		ПрефиксСкидкиНадбавки,
		РезультатыАнализов)

	Если ВыборкаПоказатели.Натуральная Тогда

		Если ВыборкаПоказатели.КоммерческийПоказатель = МенеджерПоказатели.ЗерноваяПримесь Тогда

			РезультатыАнализов.Вставить(
				СтрШаблон("%1Натуральная%2", ВыборкаПоказатели.ИмяПоказателя, ПрефиксСкидкиНадбавки),
				ВыборкаПоказатели.СкидкаНадбавка);
			РезультатыАнализов.Вставить(
				СтрШаблон("%1Натуральная", ВыборкаПоказатели.ИмяПоказателя),
				ВыборкаПоказатели.Значение);

		ИначеЕсли ВыборкаПоказатели.КоммерческийПоказатель = МенеджерПоказатели.ВлажностьЗерна
			Или ВыборкаПоказатели.КоммерческийПоказатель = МенеджерПоказатели.СорнаяПримесь
			Или ВыборкаПоказатели.КоммерческийПоказатель = МенеджерПоказатели.МасличнаяПримесь Тогда

			РезультатыАнализов.Вставить(
				СтрШаблон("%1%2", ВыборкаПоказатели.ИмяПоказателя, ПрефиксСкидкиНадбавки),
				ВыборкаПоказатели.СкидкаНадбавка);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьДенежнуюСкидкуНадбавкуВРезультатыАнализов(
	ВыборкаПоказатели,
	МенеджерПоказатели,
	ПрефиксСкидкиНадбавки,
	РезультатыАнализов)

	Если ВыборкаПоказатели.Денежная Тогда

		Если ВыборкаПоказатели.КоммерческийПоказатель = МенеджерПоказатели.ЗерноваяПримесь Тогда

			РезультатыАнализов.Вставить(
				СтрШаблон("%1Денежная%2", ВыборкаПоказатели.ИмяПоказателя, ПрефиксСкидкиНадбавки),
				ВыборкаПоказатели.СкидкаНадбавка);
			РезультатыАнализов.Вставить(
				СтрШаблон("%1Денежная", ВыборкаПоказатели.ИмяПоказателя),
				ВыборкаПоказатели.Значение);

		ИначеЕсли ВыборкаПоказатели.КоммерческийПоказатель = МенеджерПоказатели.Натура
			Или ВыборкаПоказатели.КоммерческийПоказатель = МенеджерПоказатели.Протеин
			Или ВыборкаПоказатели.КоммерческийПоказатель = МенеджерПоказатели.МассоваяДоляМасла
			Или ВыборкаПоказатели.КоммерческийПоказатель = МенеджерПоказатели.МассоваяДоляМаслаАСВ Тогда

			РезультатыАнализов.Вставить(
				СтрШаблон("%1%2", ВыборкаПоказатели.ИмяПоказателя, ПрефиксСкидкиНадбавки),
				ВыборкаПоказатели.СкидкаНадбавка);

		КонецЕсли;

	КонецЕсли;

КонецПроцедуры

Процедура ДобавитьПоказательВРезультатыАнализов(ВыборкаПоказатели, МенеджерПоказатели, РезультатыАнализов)

	Если ВыборкаПоказатели.КоммерческийПоказатель = МенеджерПоказатели.Цвет
		Или ВыборкаПоказатели.КоммерческийПоказатель = МенеджерПоказатели.Запах Тогда

		ЗначениеПоказателя = ?(ЗначениеЗаполнено(ВыборкаПоказатели.Значение),
			ВыборкаПоказатели.Значение, "соответствует");
	Иначе
		ЗначениеПоказателя = ВыборкаПоказатели.Значение;
	КонецЕсли;

	Если ВыборкаПоказатели.КоммерческийПоказатель = МенеджерПоказатели.МассоваяДоляМасла
		И Не РезультатыАнализов.Свойство("Масличность") Тогда

		РезультатыАнализов.Вставить("Масличность", ЗначениеПоказателя);

	ИначеЕсли ВыборкаПоказатели.КоммерческийПоказатель = МенеджерПоказатели.МассоваяДоляМаслаАСВ Тогда
		РезультатыАнализов.Вставить("Масличность", ЗначениеПоказателя);
	Иначе
		РезультатыАнализов.Вставить(ВыборкаПоказатели.ИмяПоказателя, ЗначениеПоказателя);
	КонецЕсли;

КонецПроцедуры

Процедура ВывестиОбластьОборотнаяСторонаДенежныйРасчетШапка(
	ВыборкаУслугиИтоги,
	ВыборкаШапка,
	ОбластьОборотнаяСторонаДенежныйРасчетШапка,
	Отбор,
	ТабличныйДокумент)

	ОбластьОборотнаяСторонаДенежныйРасчетШапка.Параметры.Заполнить(ВыборкаШапка);

	// Денежная скидка (по проценту)
	ЗнаменательСкидки 	= 100;
	ДенежнаяСкидкаВсего = ВыборкаШапка.СуммаВсего * ВыборкаШапка.ДенежнаяСкидкаНадбавка / ЗнаменательСкидки;
	Если ВыборкаУслугиИтоги.НайтиСледующий(Отбор) Тогда
		ДенежнаяСкидкаВсего = ДенежнаяСкидкаВсего + ВыборкаУслугиИтоги.СуммаСкидкиНадбавки;
	КонецЕсли;

	ОбластьОборотнаяСторонаДенежныйРасчетШапка.Параметры["ДенежнаяСкидкаВсего"]	= ДенежнаяСкидкаВсего;
	ТабличныйДокумент.Вывести(ОбластьОборотнаяСторонаДенежныйРасчетШапка);

КонецПроцедуры

Процедура ВывестиОбластьОборотнаяСторонаДенежныйРасчетСтрокаИтог(
	ВыборкаУслуги,
	ОбластьОборотнаяСторонаДенежныйРасчетИтог,
	ОбластьОборотнаяСторонаДенежныйРасчетСтрока,
	Отбор,
	ТабличныйДокумент)

	Пока ВыборкаУслуги.НайтиСледующий(Отбор) Цикл

		Выборка	= ВыборкаУслуги.Выбрать();
		Пока Выборка.Следующий() Цикл

			ОбластьОборотнаяСторонаДенежныйРасчетСтрока.Параметры.Заполнить(Выборка);
			ОбластьОборотнаяСторонаДенежныйРасчетСтрока.Параметры["Всего"]
				= гкс_ФормированиеПечатныхФорм.ФорматСумм(Выборка.Всего);
			ТабличныйДокумент.Вывести(ОбластьОборотнаяСторонаДенежныйРасчетСтрока);

		КонецЦикла;

		ОбластьОборотнаяСторонаДенежныйРасчетИтог.Параметры.Заполнить(ВыборкаУслуги);
		ОбластьОборотнаяСторонаДенежныйРасчетИтог.Параметры["Всего"]
			= гкс_ФормированиеПечатныхФорм.ФорматСумм(ВыборкаУслуги.Всего);
		ТабличныйДокумент.Вывести(ОбластьОборотнаяСторонаДенежныйРасчетИтог);

	КонецЦикла;

КонецПроцедуры

Процедура ВывестиОбластьОборотнаяСторонаПодвал(ОбластьОборотнаяСторонаПодвал, ПараметрыПечати, ТабличныйДокумент)

	ОбластьОборотнаяСторонаПодвал.Параметры["ДолжностьСоставил"] = ПараметрыПечати.РеестрСоставил;
	ОбластьОборотнаяСторонаПодвал.Параметры["ДолжностьПроверил"] = ПараметрыПечати.Проверил;
	ТабличныйДокумент.Вывести(ОбластьОборотнаяСторонаПодвал);

КонецПроцедуры

Функция ИнициализироватьДанныеПечатиЗПП3(МассивОбъектов)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.УстановитьПараметр("МассивОбъектов"		, МассивОбъектов);
	Запрос.УстановитьПараметр("ФондСобственный"		, "Собственное");
	Запрос.УстановитьПараметр("ФондХранение"		, "Хранение");
	Запрос.УстановитьПараметр("БезНДС"				, "без НДС");
	Запрос.УстановитьПараметр("СУчетомНДС"			, "с учетом НДС");
	Запрос.УстановитьПараметр("РазделительЗапятая"	, ", ");
	Запрос.Текст = ТекстЗапросаДанныеПечатиЗПП3();

	Возврат Запрос.ВыполнитьПакет();

КонецФункции

Функция ТекстЗапросаДанныеПечатиЗПП3()

	Возврат
	"ВЫБРАТЬ
	|	РеестрНакладных.Ссылка КАК Ссылка,
	|	РеестрНакладных.Номер КАК Номер,
	|	РеестрНакладных.Дата КАК Дата,
	|	РеестрНакладных.Организация КАК Организация,
	|	РеестрНакладных.Контрагент КАК Контрагент,
	|	РеестрНакладных.Грузоотправитель КАК Грузоотправитель,
	|	РеестрНакладных.Собственник КАК Собственник,
	|	РеестрНакладных.Анализ КАК Анализ,
	|	РеестрНакладных.ТочкаМаршрута КАК ТочкаМаршрута,
	|	РеестрНакладных.Номенклатура КАК Номенклатура,
	|	РеестрНакладных.ФизическийВес КАК ФизическийВес,
	|	РеестрНакладных.ЗачетныйВес КАК ЗачетныйВес,
	|	РеестрНакладных.Цена КАК Цена,
	|	РеестрНакладных.Сумма КАК Сумма,
	|	РеестрНакладных.СуммаНДС КАК СуммаНДС,
	|	РеестрНакладных.СтавкаНДС КАК СтавкаНДС,
	|	РеестрНакладных.ЦенаВключаетНДС КАК ЦенаВключаетНДС
	|ПОМЕСТИТЬ РеестрыШапка
	|ИЗ
	|	Документ.гкс_РеестрНакладныхЗПП3 КАК РеестрНакладных
	|ГДЕ
	|	РеестрНакладных.Ссылка В(&МассивОбъектов)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеестрНакладные.Ссылка КАК Ссылка,
	|	РеестрНакладные.НомерСтроки КАК НомерСтроки,
	|	РеестрНакладные.ДокументРегистрации.ДатаДокументаПоставщика КАК ДатаНакладной,
	|	РеестрНакладные.ДокументРегистрации.НомерДокументаПоставщика КАК НомерНакладной,
	|	РеестрНакладные.ДокументРегистрации.ТранспортноеСредство КАК НомерТранспорта,
	|	РеестрНакладные.ДокументРегистрации.ТочкаМаршрута КАК ТочкаМаршрута,
	|	РеестрНакладные.Брутто - РеестрНакладные.Тара КАК Масса
	|ПОМЕСТИТЬ РеестрНакладные
	|ИЗ
	|	РеестрыШапка КАК РеестрыШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РеестрНакладныхЗПП3.Накладные КАК РеестрНакладные
	|		ПО РеестрыШапка.Ссылка = РеестрНакладные.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеестрКачественныеПоказатели.Ссылка КАК Ссылка,
	|	РеестрКачественныеПоказатели.Натуральная КАК Натуральная,
	|	РеестрКачественныеПоказатели.Денежная КАК Денежная,
	|	РеестрКачественныеПоказатели.Показатель КАК Показатель,
	|	РеестрКачественныеПоказатели.Значение КАК Значение,
	|	РеестрКачественныеПоказатели.СкидкаНадбавка КАК СкидкаНадбавка
	|ПОМЕСТИТЬ РеестрКачественныеПоказатели
	|ИЗ
	|	РеестрыШапка КАК РеестрыШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РеестрНакладныхЗПП3.КачественныеПоказатели КАК РеестрКачественныеПоказатели
	|		ПО РеестрыШапка.Ссылка = РеестрКачественныеПоказатели.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	гкс_РеестрНакладныхЗПП3Услуги.Ссылка КАК Ссылка,
	|	гкс_РеестрНакладныхЗПП3Услуги.Номенклатура КАК Номенклатура,
	|	гкс_РеестрНакладныхЗПП3Услуги.СкидкаНадбавка КАК СкидкаНадбавка,
	|	гкс_РеестрНакладныхЗПП3Услуги.Цена КАК Цена,
	|	гкс_РеестрНакладныхЗПП3Услуги.СуммаНДС КАК СуммаНДС,
	|	гкс_РеестрНакладныхЗПП3Услуги.Сумма КАК Сумма,
	|	гкс_РеестрНакладныхЗПП3Услуги.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	|	гкс_РеестрНакладныхЗПП3Услуги.КоличествоУслуги КАК КоличествоУслуги,
	|	РеестрыШапка.ЦенаВключаетНДС КАК ЦенаВключаетНДС
	|ПОМЕСТИТЬ РеестрУслуги
	|ИЗ
	|	РеестрыШапка КАК РеестрыШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_РеестрНакладныхЗПП3.Услуги КАК гкс_РеестрНакладныхЗПП3Услуги
	|		ПО РеестрыШапка.Ссылка = гкс_РеестрНакладныхЗПП3Услуги.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеестрКачественныеПоказатели.Ссылка КАК Ссылка,
	|	РеестрКачественныеПоказатели.СкидкаНадбавка КАК НатуральнаяСкидкаНадбавка,
	|	0 КАК ДенежнаяСкидкаНадбавка
	|ПОМЕСТИТЬ РеестрСкидкиНадбавкиОбъединение
	|ИЗ
	|	РеестрКачественныеПоказатели КАК РеестрКачественныеПоказатели
	|ГДЕ
	|	РеестрКачественныеПоказатели.Натуральная
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	РеестрКачественныеПоказатели.Ссылка,
	|	0,
	|	РеестрКачественныеПоказатели.СкидкаНадбавка
	|ИЗ
	|	РеестрКачественныеПоказатели КАК РеестрКачественныеПоказатели
	|ГДЕ
	|	РеестрКачественныеПоказатели.Денежная
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеестрСкидкиНадбавкиОбъединение.Ссылка КАК Ссылка,
	|	СУММА(РеестрСкидкиНадбавкиОбъединение.НатуральнаяСкидкаНадбавка) КАК НатуральнаяСкидкаНадбавка,
	|	СУММА(РеестрСкидкиНадбавкиОбъединение.ДенежнаяСкидкаНадбавка) КАК ДенежнаяСкидкаНадбавка
	|ПОМЕСТИТЬ РеестрСкидкиНадбавки
	|ИЗ
	|	РеестрСкидкиНадбавкиОбъединение КАК РеестрСкидкиНадбавкиОбъединение
	|
	|СГРУППИРОВАТЬ ПО
	|	РеестрСкидкиНадбавкиОбъединение.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеестрНакладные.Ссылка КАК Ссылка,
	|	МАКСИМУМ(РеестрНакладные.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ РеестрКоличествоНакладных
	|ИЗ
	|	РеестрНакладные КАК РеестрНакладные
	|
	|СГРУППИРОВАТЬ ПО
	|	РеестрНакладные.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	РеестрыШапка.Ссылка КАК Ссылка,
	|	РеестрыШапка.ТочкаМаршрута КАК ТочкаМаршрута,
	|	ЛабораторныйАнализ.Показатель КАК Показатель,
	|	ЛабораторныйАнализ.Значение КАК Значение
	|ПОМЕСТИТЬ ЛабАнализКачественныеПоказатели
	|ИЗ
	|	РеестрыШапка КАК РеестрыШапка
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ.КачественныеПоказатели КАК ЛабораторныйАнализ
	|		ПО РеестрыШапка.Анализ = ЛабораторныйАнализ.Ссылка
	|ГДЕ
	|	НЕ (РеестрыШапка.Ссылка, ЛабораторныйАнализ.Показатель) В
	|				(ВЫБРАТЬ
	|					Таб.Ссылка,
	|					Таб.Показатель
	|				ИЗ
	|					РеестрКачественныеПоказатели КАК Таб)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеестрКачественныеПоказатели.Ссылка КАК Ссылка,
	|	РеестрыШапка.ТочкаМаршрута КАК ТочкаМаршрута,
	|	РеестрКачественныеПоказатели.Показатель КАК Показатель,
	|	РеестрКачественныеПоказатели.Значение КАК ЗначениеРеестра,
	|	0 КАК ЗначениеАнализа,
	|	РеестрКачественныеПоказатели.Натуральная КАК Натуральная,
	|	РеестрКачественныеПоказатели.Денежная КАК Денежная,
	|	РеестрКачественныеПоказатели.СкидкаНадбавка КАК СкидкаНадбавка,
	|	ИСТИНА КАК ПоказательРеестра
	|ПОМЕСТИТЬ КачественныеПоказателиОбъединенные
	|ИЗ
	|	РеестрКачественныеПоказатели КАК РеестрКачественныеПоказатели
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РеестрыШапка КАК РеестрыШапка
	|		ПО РеестрКачественныеПоказатели.Ссылка = РеестрыШапка.Ссылка
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЛабАнализКачественныеПоказатели.Ссылка,
	|	ЛабАнализКачественныеПоказатели.ТочкаМаршрута,
	|	ЛабАнализКачественныеПоказатели.Показатель,
	|	0,
	|	ЛабАнализКачественныеПоказатели.Значение,
	|	ЛОЖЬ,
	|	ЛОЖЬ,
	|	NULL,
	|	ЛОЖЬ
	|ИЗ
	|	ЛабАнализКачественныеПоказатели КАК ЛабАнализКачественныеПоказатели
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КачественныеПоказателиОбъединенные.Ссылка КАК Ссылка,
	|	КачественныеПоказателиОбъединенные.ТочкаМаршрута КАК ТочкаМаршрута,
	|	КачественныеПоказателиОбъединенные.Показатель КАК Показатель,
	|	МАКСИМУМ(КачественныеПоказателиОбъединенные.ЗначениеРеестра) КАК ЗначениеРеестра,
	|	МАКСИМУМ(КачественныеПоказателиОбъединенные.ЗначениеАнализа) КАК ЗначениеАнализа,
	|	МАКСИМУМ(КачественныеПоказателиОбъединенные.Натуральная) КАК Натуральная,
	|	МАКСИМУМ(КачественныеПоказателиОбъединенные.Денежная) КАК Денежная,
	|	МАКСИМУМ(КачественныеПоказателиОбъединенные.СкидкаНадбавка) КАК СкидкаНадбавка,
	|	МАКСИМУМ(КачественныеПоказателиОбъединенные.ПоказательРеестра) КАК ПоказательРеестра
	|ПОМЕСТИТЬ КачественныеПоказателиСгруппированные
	|ИЗ
	|	КачественныеПоказателиОбъединенные КАК КачественныеПоказателиОбъединенные
	|
	|СГРУППИРОВАТЬ ПО
	|	КачественныеПоказателиОбъединенные.Ссылка,
	|	КачественныеПоказателиОбъединенные.ТочкаМаршрута,
	|	КачественныеПоказателиОбъединенные.Показатель
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КачественныеПоказателиСгруппированные.Ссылка КАК Ссылка,
	|	МАКСИМУМ(КачественныеПоказателиСгруппированные.ЗначениеРеестра) КАК ЗначениеРеестра,
	|	МАКСИМУМ(КачественныеПоказателиСгруппированные.ЗначениеАнализа) КАК ЗначениеАнализа,
	|	МАКСИМУМ(КачественныеПоказателиСгруппированные.Натуральная) КАК Натуральная,
	|	МАКСИМУМ(КачественныеПоказателиСгруппированные.Денежная) КАК Денежная,
	|	МАКСИМУМ(КачественныеПоказателиСгруппированные.СкидкаНадбавка) КАК СкидкаНадбавка,
	|	МАКСИМУМ(КачественныеПоказателиСгруппированные.ПоказательРеестра) КАК ПоказательРеестра,
	|	ВЫБОР
	|		КОГДА КачественныеПоказателиСгруппированные.Показатель.Предопределенный
	|			ТОГДА КачественныеПоказателиСгруппированные.Показатель
	|		ИНАЧЕ ЕСТЬNULL(гкс_СопоставлениеПоказателейАнализовНоменклатуры.КоммерческийПоказатель, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ КАК КоммерческийПоказатель,
	|	ВЫБОР
	|		КОГДА КачественныеПоказателиСгруппированные.Показатель.Предопределенный
	|			ТОГДА КачественныеПоказателиСгруппированные.Показатель.ИмяПредопределенныхДанных
	|		ИНАЧЕ ЕСТЬNULL(гкс_СопоставлениеПоказателейАнализовНоменклатуры.КоммерческийПоказатель.ИмяПредопределенныхДанных, """")
	|	КОНЕЦ КАК ИмяПоказателя
	|ПОМЕСТИТЬ КачественныеПоказателиПриведенные
	|ИЗ
	|	КачественныеПоказателиСгруппированные КАК КачественныеПоказателиСгруппированные
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.гкс_СопоставлениеПоказателейАнализовНоменклатуры КАК гкс_СопоставлениеПоказателейАнализовНоменклатуры
	|		ПО КачественныеПоказателиСгруппированные.Показатель = гкс_СопоставлениеПоказателейАнализовНоменклатуры.Показатель
	|			И (гкс_СопоставлениеПоказателейАнализовНоменклатуры.ТочкаМаршрута = КачественныеПоказателиСгруппированные.ТочкаМаршрута)
	|
	|СГРУППИРОВАТЬ ПО
	|	КачественныеПоказателиСгруппированные.Ссылка,
	|	ВЫБОР
	|		КОГДА КачественныеПоказателиСгруппированные.Показатель.Предопределенный
	|			ТОГДА КачественныеПоказателиСгруппированные.Показатель
	|		ИНАЧЕ ЕСТЬNULL(гкс_СопоставлениеПоказателейАнализовНоменклатуры.КоммерческийПоказатель, НЕОПРЕДЕЛЕНО)
	|	КОНЕЦ,
	|	ВЫБОР
	|		КОГДА КачественныеПоказателиСгруппированные.Показатель.Предопределенный
	|			ТОГДА КачественныеПоказателиСгруппированные.Показатель.ИмяПредопределенныхДанных
	|		ИНАЧЕ ЕСТЬNULL(гкс_СопоставлениеПоказателейАнализовНоменклатуры.КоммерческийПоказатель.ИмяПредопределенныхДанных, """")
	|	КОНЕЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеестрНакладных.Ссылка КАК Ссылка,
	|	РеестрНакладных.Номер КАК Номер,
	|	РеестрНакладных.Дата КАК Дата,
	|	РеестрНакладных.Организация КАК Организация,
	|	ЕСТЬNULL(Организации.НаименованиеПолное, """") КАК ОрганизацияНаименованиеПолное,
	|	ЕСТЬNULL(Контрагенты.НаименованиеПолное, """") КАК Контрагент,
	|	ЕСТЬNULL(Грузоотправители.НаименованиеПолное, """") КАК Грузоотправитель,
	|	ЕСТЬNULL(Собственники.НаименованиеПолное, """") КАК Собственник,
	|	ВЫБОР
	|		КОГДА ЕСТЬNULL(Организации.КонтрагентОрганизации, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка)) = ЕСТЬNULL(Собственники.Ссылка, ЗНАЧЕНИЕ(Справочник.Контрагенты.ПустаяСсылка))
	|			ТОГДА &ФондСобственный
	|		ИНАЧЕ &ФондХранение
	|	КОНЕЦ КАК Фонд,
	|	ЕСТЬNULL(Документгкс_ЛабораторныйАнализ.Дата, ДАТАВРЕМЯ(1, 1, 1)) КАК ДатаОбразца,
	|	ЕСТЬNULL(Документгкс_ЛабораторныйАнализ.НомерПробы, """") КАК НомерПробы,
	|	ЕСТЬNULL(РеестрКоличествоНакладных.НомерСтроки, 0) КАК КоличествоНакладных,
	|	РеестрНакладных.Номенклатура КАК Номенклатура,
	|	ПРЕДСТАВЛЕНИЕ(РеестрНакладных.Номенклатура.ЕдиницаИзмерения) КАК ЕдиницаИзмерения,
	|	РеестрНакладных.ФизическийВес КАК ФизическийВес,
	|	100 + ЕСТЬNULL(РеестрСкидкиНадбавки.НатуральнаяСкидкаНадбавка, 0) КАК ПроцентЗачетнойМассы,
	|	ЕСТЬNULL(РеестрСкидкиНадбавки.НатуральнаяСкидкаНадбавка, 0) КАК НатуральнаяСкидкаНадбавка,
	|	ЕСТЬNULL(РеестрСкидкиНадбавки.ДенежнаяСкидкаНадбавка, 0) КАК ДенежнаяСкидкаНадбавка,
	|	РеестрНакладных.ЗачетныйВес КАК ЗачетныйВес,
	|	РеестрНакладных.Цена КАК Цена,
	|	РеестрНакладных.Сумма КАК Сумма,
	|	РеестрНакладных.СуммаНДС КАК СуммаНДС,
	|	РеестрНакладных.СтавкаНДС КАК СтавкаНДС,
	|	РеестрНакладных.ЦенаВключаетНДС КАК ЦенаВключаетНДС,
	|	ВЫБОР
	|		КОГДА РеестрНакладных.ЦенаВключаетНДС
	|			ТОГДА РеестрНакладных.Сумма
	|		ИНАЧЕ РеестрНакладных.Сумма + РеестрНакладных.СуммаНДС
	|	КОНЕЦ КАК СуммаВсего,
	|	ВЫБОР
	|		КОГДА РеестрНакладных.ЦенаВключаетНДС
	|			ТОГДА &СУчетомНДС
	|		ИНАЧЕ &БезНДС
	|	КОНЕЦ КАК УчетНДС,
	|	ЕСТЬNULL(Организации.КодПоОКПО, """") КАК КодОКПО,
	|	ЕСТЬNULL(Грузоотправители.Адрес, """") КАК ГрузоотправительАдрес
	|ИЗ
	|	РеестрыШапка КАК РеестрНакладных
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Организации КАК Организации
	|		ПО РеестрНакладных.Организация = Организации.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РеестрКоличествоНакладных КАК РеестрКоличествоНакладных
	|		ПО РеестрНакладных.Ссылка = РеестрКоличествоНакладных.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Контрагенты
	|		ПО РеестрНакладных.Контрагент = Контрагенты.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Грузоотправители
	|		ПО РеестрНакладных.Грузоотправитель = Грузоотправители.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Контрагенты КАК Собственники
	|		ПО РеестрНакладных.Собственник = Собственники.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ РеестрСкидкиНадбавки КАК РеестрСкидкиНадбавки
	|		ПО РеестрНакладных.Ссылка = РеестрСкидкиНадбавки.Ссылка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.гкс_ЛабораторныйАнализ КАК Документгкс_ЛабораторныйАнализ
	|		ПО РеестрНакладных.Анализ = Документгкс_ЛабораторныйАнализ.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеестрНакладные.Ссылка КАК Ссылка,
	|	РеестрНакладные.НомерСтроки КАК НомерСтроки,
	|	РеестрНакладные.ДатаНакладной КАК ДатаНакладной,
	|	РеестрНакладные.НомерНакладной КАК НомерНакладной,
	|	РеестрНакладные.НомерТранспорта КАК НомерТранспорта,
	|	РеестрНакладные.ТочкаМаршрута КАК ТочкаМаршрута,
	|	РеестрНакладные.ТочкаМаршрута.Склад.Наименование КАК ПунктРазгрузкиСклад,
	|	РеестрНакладные.Масса КАК Масса
	|ИЗ
	|	РеестрНакладные КАК РеестрНакладные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеестрУслуги.Ссылка КАК Ссылка,
	|	РеестрУслуги.Номенклатура.Наименование + &РазделительЗапятая + РеестрУслуги.ЕдиницаИзмерения.Наименование КАК Наименование,
	|	РеестрУслуги.Цена КАК Цена,
	|	РеестрУслуги.КоличествоУслуги КАК Количество,
	|	РеестрУслуги.Сумма КАК Сумма,
	|	РеестрУслуги.СуммаНДС КАК СуммаНДС,
	|	РеестрУслуги.Сумма + ВЫБОР
	|		КОГДА РеестрУслуги.ЦенаВключаетНДС
	|			ТОГДА РеестрУслуги.СуммаНДС
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Всего
	|ИЗ
	|	РеестрУслуги КАК РеестрУслуги
	|ГДЕ
	|	НЕ РеестрУслуги.СкидкаНадбавка = 0
	|ИТОГИ
	|	СУММА(Количество),
	|	СУММА(Сумма),
	|	СУММА(СуммаНДС),
	|	СУММА(Всего)
	|ПО
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	РеестрУслуги.Ссылка КАК Ссылка,
	|	СУММА(РеестрУслуги.Сумма + ВЫБОР
	|			КОГДА РеестрУслуги.ЦенаВключаетНДС
	|				ТОГДА РеестрУслуги.СуммаНДС
	|			ИНАЧЕ 0
	|		КОНЕЦ * ВЫБОР
	|			КОГДА РеестрУслуги.СкидкаНадбавка < 0
	|				ТОГДА -1
	|			ИНАЧЕ 1
	|		КОНЕЦ) КАК СуммаСкидкиНадбавки
	|ИЗ
	|	РеестрУслуги КАК РеестрУслуги
	|ГДЕ
	|	НЕ РеестрУслуги.СкидкаНадбавка = 0
	|
	|СГРУППИРОВАТЬ ПО
	|	РеестрУслуги.Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	КачественныеПоказателиПриведенные.Ссылка КАК Ссылка,
	|	ВЫБОР
	|		КОГДА НЕ КачественныеПоказателиПриведенные.ЗначениеРеестра = 0
	|			ТОГДА КачественныеПоказателиПриведенные.ЗначениеРеестра
	|		ИНАЧЕ КачественныеПоказателиПриведенные.ЗначениеАнализа
	|	КОНЕЦ КАК Значение,
	|	КачественныеПоказателиПриведенные.Натуральная КАК Натуральная,
	|	КачественныеПоказателиПриведенные.Денежная КАК Денежная,
	|	КачественныеПоказателиПриведенные.СкидкаНадбавка КАК СкидкаНадбавка,
	|	КачественныеПоказателиПриведенные.ПоказательРеестра КАК ПоказательРеестра,
	|	КачественныеПоказателиПриведенные.КоммерческийПоказатель КАК КоммерческийПоказатель,
	|	КачественныеПоказателиПриведенные.ИмяПоказателя КАК ИмяПоказателя
	|ИЗ
	|	КачественныеПоказателиПриведенные КАК КачественныеПоказателиПриведенные
	|ГДЕ
	|	НЕ КачественныеПоказателиПриведенные.КоммерческийПоказатель = НЕОПРЕДЕЛЕНО";

КонецФункции

#КонецОбласти

#КонецОбласти

Функция ОбластьВАдресеКонтрагента(Адрес)

	Результат = "";

	УровниАдреса = СтрРазделить(Адрес, ",", Ложь);
	Для Каждого Уровень Из УровниАдреса Цикл
		Если СтрНайти(Уровень, " обл") > 0 Тогда
			Результат = Уровень;
			Прервать;
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

#КонецОбласти

#КонецЕсли
